# Series

In [1]:
import pandas as pd
a=pd.Series([23,45,26,67,81])
a

0    23
1    45
2    26
3    67
4    81
dtype: int64

In [2]:
a.name="Random numbers"
a

0    23
1    45
2    26
3    67
4    81
Name: Random numbers, dtype: int64

In [3]:
b=pd.Series(['abc','def','hij'])
b

0    abc
1    def
2    hij
dtype: object

In [4]:
b.dtype

dtype('O')

In [5]:
a.dtype

dtype('int64')

In [6]:
a.values

array([23, 45, 26, 67, 81], dtype=int64)

In [7]:
type(b.values)

numpy.ndarray

In [8]:
type(a)

pandas.core.series.Series

In [9]:
a.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
a[1:4]

1    45
2    26
3    67
Name: Random numbers, dtype: int64

In [11]:
a.index=['a','b','c','d','e']
a

a    23
b    45
c    26
d    67
e    81
Name: Random numbers, dtype: int64

In [12]:
a['b':'e']

b    45
c    26
d    67
e    81
Name: Random numbers, dtype: int64

In [13]:
d={'a':2,'b':3,'c':6,'d':10}
d

{'a': 2, 'b': 3, 'c': 6, 'd': 10}

In [14]:
s=pd.Series(d)
s

a     2
b     3
c     6
d    10
dtype: int64

In [15]:
a

a    23
b    45
c    26
d    67
e    81
Name: Random numbers, dtype: int64

In [16]:
a.iloc[0]

23

In [17]:
a[0]

23

In [18]:
a>50

a    False
b    False
c    False
d     True
e     True
Name: Random numbers, dtype: bool

In [19]:
a.iloc[-1]

81

In [20]:
a[a>44]

b    45
d    67
e    81
Name: Random numbers, dtype: int64

In [21]:
a[(a<40)|(a>67)]

a    23
c    26
e    81
Name: Random numbers, dtype: int64

In [22]:
s.loc['b']=25
s

a     2
b    25
c     6
d    10
dtype: int64

In [23]:
s.iloc[3]=17
s

a     2
b    25
c     6
d    17
dtype: int64

# DataFrames

In [24]:
import pandas as pd
df=pd.DataFrame({'Names':['Anitha','Anusha','Aneesha'],
                 'id':[282,920,847],
                 'marks':[50,60,70]
                 })
df

     Names   id  marks
0   Anitha  282     50
1   Anusha  920     60
2  Aneesha  847     70

In [25]:
df.index=[15,27,38]
df

      Names   id  marks
15   Anitha  282     50
27   Anusha  920     60
38  Aneesha  847     70

In [26]:
df.columns

Index(['Names', 'id', 'marks'], dtype='object')

In [27]:
df.index

Int64Index([15, 27, 38], dtype='int64')

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 15 to 38
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   3 non-null      object
 1   id      3 non-null      int64
 2   marks   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 96.0+ bytes

In [29]:
df.describe()

               id  marks
count    3.000000    3.0
mean   683.000000   60.0
std    349.189061   10.0
min    282.000000   50.0
25%    564.500000   55.0
50%    847.000000   60.0
75%    883.500000   65.0
max    920.000000   70.0

In [30]:
df.size

9

In [31]:
df.shape

(3, 3)

In [32]:
df.dtypes

Names    object
id        int64
marks     int64
dtype: object

In [33]:
df.dtypes.value_counts()

int64     2
object    1
dtype: int64

# Indexing, Selection and slicing

In [34]:
df.loc[15:27]

     Names   id  marks
15  Anitha  282     50
27  Anusha  920     60

In [35]:
df.iloc[0:2]

     Names   id  marks
15  Anitha  282     50
27  Anusha  920     60

In [36]:
df.loc[38]

Names    Aneesha
id           847
marks         70
Name: 38, dtype: object

In [37]:
df.rename(columns={'phno':'mob'})
df

      Names   id  marks
15   Anitha  282     50
27   Anusha  920     60
38  Aneesha  847     70

In [38]:
df['Names'].describe(include='0')

count          3
unique         3
top       Anitha
freq           1
Name: Names, dtype: object

In [42]:
df.drop([38])

     Names   id  marks
15  Anitha  282     50
27  Anusha  920     60